In [5]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [6]:
dataset=pd.read_csv('preprocessed2.csv')

In [15]:
dataset = dataset.rename(columns = {'Number of Bedrooms': 'No_of_Bedrooms'}, inplace = False)
dataset = dataset.rename(columns = {'Property Type': 'Property_Type'}, inplace = False)

In [8]:
dataset.describe()

,Unnamed: 0,TLIST(A1),Year,C03004V03625,VALUE
count,243516.000000,243516.000000,243516.000000,243516.000000,242970.000000
mean,121757.500000,2014.000000,2014.000000,139445.627803,926.736487
std,70297.158413,3.741665,3.741665,17471.757676,364.186646
min,0.000000,2008.000000,2008.000000,110000.000000,272.920000
25%,60878.750000,2011.000000,2011.000000,124600.000000,635.469385
50%,121757.500000,2014.000000,2014.000000,137850.000000,808.812197
75%,182636.250000,2017.000000,2017.000000,155400.000000,1182.669215
max,243515.000000,2020.000000,2020.000000,171200.000000,6522.480000

In [9]:
dataset.dropna(inplace=True)

In [10]:
dataset.describe()

,Unnamed: 0,TLIST(A1),Year,C03004V03625,VALUE
count,242970.000000,242970.000000,242970.000000,242970.000000,242970.000000
mean,121757.260674,2014.000000,2014.000000,139411.797753,926.736487
std,70297.158821,3.741665,3.741665,17476.780742,364.186646
min,0.000000,2008.000000,2008.000000,110000.000000,272.920000
25%,60878.250000,2011.000000,2011.000000,124600.000000,635.469385
50%,121757.500000,2014.000000,2014.000000,137800.000000,808.812197
75%,182635.750000,2017.000000,2017.000000,155400.000000,1182.669215
max,243515.000000,2020.000000,2020.000000,171200.000000,6522.480000

In [11]:
Number_of_Bedrooms	=pd.get_dummies(dataset['No_of_Bedrooms'])

In [16]:
Property_type=pd.get_dummies(dataset['Property_Type'])

In [17]:
Location_new=pd.get_dummies(dataset['Location'])

In [18]:
dataset=pd.concat([dataset,Location_new,Number_of_Bedrooms,Property_type],axis=1)

In [19]:
dataset.drop(['STATISTIC','Statistic','Year','TLIST(A1)','No_of_Bedrooms','C02969V03591','Property_Type','C02970V03592','UNIT','Location','C03004V03625'],axis=1,inplace=True)

In [20]:
dataset.head()

,Unnamed: 0,VALUE,check_for_nan,"Abbeyfeale, Limerick","Annacotty, Limerick","Arbour Hill, Dublin 7","Ardee, Louth","Arklow, Wicklow","Artane, Dublin 5","Ashbourne, Meath",...,Four plus bed,One bed,Three bed,Two bed,All property types,Apartment,Detached house,Other flats,Semi detached house,Terrace house
0,0,752.60,False,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
1,1,797.01,False,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
2,2,754.20,False,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
3,3,717.01,False,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
4,4,571.57,False,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0

In [21]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 242970 entries, 0 to 243515
Columns: 461 entries, Unnamed: 0 to Terrace house
dtypes: bool(1), float64(1), int64(1), uint8(458)
memory usage: 111.9 MB

In [22]:
#Train data
X=dataset.drop('VALUE',axis=1)
Y=dataset['VALUE']

In [23]:
from sklearn.model_selection import train_test_split

In [24]:
X_train, X_test, Y_train, Y_test = train_test_split(X,Y, test_size=.25, random_state=42)

In [25]:
print(X_train.shape)
print(X_test.shape)
print(Y_train.shape)
print(Y_test.shape)

(182227, 460)
(60743, 460)
(182227,)
(60743,)

In [27]:
# Fitting Random Forest Regression to the dataset
from sklearn.ensemble import RandomForestRegressor
regressor = RandomForestRegressor(n_estimators = 10, random_state = 0)
regressor.fit(X_train, Y_train)

RandomForestRegressor(n_estimators=10, random_state=0)

In [28]:
Y_pred = regressor.predict(X_test)

In [29]:
df = pd.DataFrame({'Real Values':Y_test, 'Predicted Values':Y_pred})
df

        Real Values  Predicted Values
164448   478.880000        558.202000
115790   813.073036        813.073036
89801    956.210000        958.521000
183564   786.079553        786.079553
203325   588.762038        588.762038
...             ...               ...
1708     690.730000        645.472000
23657    598.807324        598.807324
141929  1228.020000       1161.551000
50467    488.127790        488.127790
140999   516.707463        516.707463

[60743 rows x 2 columns]

In [30]:
from sklearn.metrics import mean_squared_error
from sklearn.metrics import mean_absolute_error

In [32]:
print("R-Sqaured: %.3f"
      % regressor.score(X_test,Y_test))

R-Sqaured: 0.954

In [34]:
print("Mean squared error: %.3f"
      % mean_squared_error(Y_test, Y_pred))  # Test MSE

print("Mean absolute error: %.3f"
      % mean_absolute_error(Y_test, Y_pred))

Mean squared error: 6105.446
Mean absolute error: 28.613